#__author: ZhengNengjin
#__date: 2018/9/2

menu = {
	"福建省":{
		"福州市":{"仓山区","台江区","晋安区","马尾区"},
		"厦门市":{"思明区","海安区","湖里区","集美区","同安区"},
		"泉州市":{"鲤城区","丰泽区","洛江区","泉港区"},
		"南平市":{"延平区","建阳区"},
		"三明市":{"梅列区","三元区"}
	},
	"安徽省":{
		"合肥市":{"蜀山区","庐阳区","包河区","瑶海区","政务区"},
		"铜陵市":{"铜官区","义安区","郊区","野区"},
		"安庆市":{"太湖县","潜山县","怀宁县","宿松县","岳西县"},
		"六安市":{"舒城县","金寨县","霍山县","霍邱县"}
	},
	"浙江省":{
		"杭州市":{"上城区","下城区","西湖区","萧山区","余杭区"},
		"宁波市":{"海曙区","江东区","江北区","镇海区","北仑区"},
		"温州市":{"鹿城区","龙湾区","瓯海区","洞头区"}
	}
}
current_layer = menu
while True:
	for key in current_layer:
		print(key)
	choice = input(">>>:").strip()
	if len(choice) == 0: continue
	if choice in current_layer:
		current_layer = current_layer[choice]
	else:
		print("无此项")